tap "homebrew/science"
tap "homebrew/core", "git@github.com:Homebrew/homebrew-core.git"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"
tap "dunn/emacs"
tap "bramstein/webfonttools"
cask "xquartz"
brew "ack"
brew "afl-fuzz"
brew "aha"
brew "algol68g"
brew "oniguruma"
brew "jq"
brew "ansiweather"
brew "ant"
brew "apr-util"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "ascii"
brew "docbook"
brew "asciidoc"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pixman"
brew "cairo"
brew "git"
brew "atk"
brew "libsigc++"
brew "glibmm"
brew "atkmm"
brew "ats2-postiats"
brew "autoconf"
brew "automake"
brew "bash"
brew "bcrypt"
brew "bdw-gc"
brew "binaryen"
brew "binutils"
brew "bison"
brew "boost"
brew "gdbm"
brew "python3"
brew "boost-python"
brew "brotli"
brew "bullet"
brew "ghc"
brew "cabal-install"
brew "cairomm"
brew "gsasl"
brew "libtool"
brew "libunistring"
brew "nettle"
brew "emacs", args: ["with-ctags", "with-dbus", "with-gnutls", "with-mailutils"]
brew "cask"
brew "cd-discid"
brew "cfitsio"
brew "cgal"
brew "checkbashisms"
brew "libsigsegv"
brew "clisp"
brew "gmp@4"
brew "isl@0.12"
brew "cloog"
brew "cmake"
brew "cmark"
brew "colordiff"
brew "coreutils"
brew "cscope"
brew "curl"
brew "zeromq"
brew "czmq"
brew "dash"
brew "dbus"
brew "openjpeg"
brew "wxmac"
brew "diff-pdf"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "docutils"
brew "docx2txt"
brew "dos2unix"
brew "doxygen"
brew "libzip"
brew "ebook-tools"
brew "editorconfig"
brew "icu4c"
brew "node", args: ["devel"]
brew "yuicompressor"
brew "emscripten"
brew "eot-utils"
brew "ghostscript"
brew "erlang"
brew "exiftool"
brew "exploitdb"
brew "faac"
brew "fdk-aac"
brew "fdupes"
brew "lame"
brew "x264"
brew "xvid"
brew "ffmpeg"
brew "fftw"
brew "findutils"
brew "flac"
brew "fltk"
brew "graphite2"
brew "harfbuzz"
brew "pango"
brew "python"
brew "fontforge"
brew "fonttools"
brew "fortune"
brew "frei0r"
brew "fribidi"
brew "gawk"
brew "gd"
brew "gdk-pixbuf"
brew "geographiclib"
brew "geoip", args: ["with-geoipupdate"]
brew "geoipupdate"
brew "gflags"
brew "ilmbase"
brew "imagemagick", args: ["with-ghostscript", "with-hdri", "with-little-cms", "with-little-cms2", "with-openexr", "with-webp"]
brew "gifify"
brew "giflib"
brew "gist"
brew "git-lfs"
brew "gl2ps"
brew "glm"
brew "glog"
brew "gnu-apl"
brew "gnu-getopt"
brew "gnu-sed", args: ["with-default-names"]
brew "lua"
brew "gnutls"
brew "grap"
brew "graphicsmagick"
brew "grep", args: ["with-default-names"]
brew "groff", args: ["with-gpresent", "with-grohtml", "with-gropdf"]
brew "gsl"
brew "hicolor-icon-theme"
brew "shared-mime-info"
brew "gtk+"
brew "gtkglext"
brew "pangomm"
brew "gtkmm"
brew "szip"
brew "help2man"
brew "hexedit"
brew "highlight"
brew "html-xml-utils"
brew "hub"
brew "hunspell"
brew "id3lib"
brew "id3v2"
brew "ievms"
brew "imagesnap"
brew "imageworsener"
brew "iniparser"
brew "ipython"
brew "iso-codes"
brew "jasper"
brew "jbig2dec"
brew "json-c"
brew "json-fortran"
brew "pandoc"
brew "jupyter"
brew "subversion"
brew "netpbm"
brew "latex2html"
brew "less", args: ["with-pcre"]
brew "snappy"
brew "leveldb"
brew "lfe"
brew "lib3ds"
brew "libart"
brew "libass"
brew "libogg"
brew "libvorbis"
brew "libvpx"
brew "opus"
brew "libav"
brew "libbluray"
brew "libcaca"
brew "libcroco"
brew "libexif"
brew "libgsf"
brew "libidn"
brew "liblqr"
brew "libmagic"
brew "libmatio"
brew "sdl"
brew "libmpeg2"
brew "libpcl"
brew "libquvi"
brew "libraw"
brew "librsvg"
brew "libsodium"
brew "libsoxr"
brew "libspiro"
brew "libssh2"
brew "libsvg"
brew "libsvg-cairo"
brew "libuninameslist"
brew "libusb"
brew "libusb-compat"
brew "libuv"
brew "libvidstab"
brew "libvo-aacenc"
brew "libwebm"
brew "libwebsockets"
brew "libwmf"
brew "libxslt"
brew "libyaml", args: ["universal"]
brew "lightning"
brew "links"
brew "lmdb"
brew "lynx"
brew "macvim"
brew "mailutils"
brew "makedepend"
brew "malbolge"
brew "mandoc"
brew "markdown"
brew "mdk"
brew "media-info"
brew "mercurial"
brew "mit-scheme"
brew "mlton"
brew "mmix"
brew "mongodb", restart_service: true
brew "moreutils"
brew "mp3info"
brew "mysql", restart_service: true
brew "ncurses"
brew "nano"
brew "nasm"
brew "ninja"
brew "node@6"
brew "plotutils"
brew "pstoedit"
brew "octave"
brew "oggz"
brew "open-mesh"
brew "open-scene-graph"
brew "opencore-amr"
brew "openexr"
brew "opencv"
brew "openslide"
brew "openvpn"
brew "orc"
brew "ossp-uuid"
brew "p7zip"
brew "partio"
brew "tree"
brew "pass"
brew "pcre2"
brew "pdfgrep", args: ["with-pcre"]
brew "pdftoedn"
brew "phantomjs"
brew "pinentry"
brew "pngcheck"
brew "pngnq"
brew "pngquant"
brew "popt"
brew "poster"
brew "postgresql"
brew "povray"
brew "protobuf"
brew "psutils"
brew "putty"
brew "pwgen"
brew "py2cairo"
brew "pygobject3"
brew "qt"
brew "rakudo-star"
brew "re2c"
brew "rename"
brew "rsync"
brew "rtmpdump"
brew "ruby"
brew "rust"
brew "sbcl"
brew "schroedinger"
brew "scipy"
brew "screen"
brew "sip"
brew "source-highlight"
brew "st"
brew "svg2pdf"
brew "svg2png"
brew "swig"
brew "t1utils"
brew "texi2html"
brew "texinfo"
brew "texmath"
brew "theora"
brew "tidy-html5"
brew "tmux"
brew "tor"
brew "torsocks"
brew "ttf2pt1"
brew "ttfautohint"
brew "unixodbc"
brew "unpaper"
brew "unrar"
brew "vbindiff"
brew "vim"
brew "vips"
brew "wabt"
brew "watch"
brew "watchexec"
brew "watchman"
brew "wget"
brew "wgetpaste"
brew "x265"
brew "yasm"
brew "zopfli"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "bramstein/webfonttools/woff2"
brew "dunn/emacs/aggressive-indent"
brew "dunn/emacs/dash-emacs"
brew "dunn/emacs/ansi-emacs"
brew "dunn/emacs/ascii-art-to-unicode"
brew "dunn/emacs/async-emacs"
brew "dunn/emacs/cl-lib"
brew "dunn/emacs/clojure-mode"
brew "dunn/emacs/coffee-mode"
brew "dunn/emacs/csv-mode"
brew "dunn/emacs/editorconfig-emacs"
brew "dunn/emacs/org-mode"
brew "dunn/emacs/powerline-emacs"
brew "dunn/emacs/rust-mode", args: ["HEAD"]
brew "dunn/emacs/scss-mode"
brew "dunn/emacs/tablist"
brew "dunn/emacs/yaml-mode"
brew "homebrew/science/fasttree"
brew "homebrew/science/field3d"
brew "homebrew/science/mathgl"
cask "0xed"
cask "android-sdk"
cask "audio-hijack"
cask "beyond-compare"
cask "dropbox"
cask "emin-webpquicklook"
cask "firefox"
cask "flash-decompiler-trillix"
cask "glyphs"
cask "handbrake"
cask "inkscape"
cask "iterm2"
cask "jupyter-notebook-ql"
cask "poedit"
cask "postman"
cask "qlcommonmark"
cask "qlrest"
cask "robo-3t"
cask "senuti"
cask "sequel-pro"
cask "soulseek"
cask "sqlitebrowser"
cask "textmate"
cask "tunnelblick"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "xld"
cask "caskroom/fonts/font-bitstream-vera"
cask "caskroom/fonts/font-dejavu-sans"
cask "caskroom/fonts/font-doulos-sil"
cask "caskroom/fonts/font-freesans"
cask "caskroom/fonts/font-gentium-plus"
cask "caskroom/fonts/font-hasklig"
cask "caskroom/fonts/font-liberation-sans"
cask "caskroom/fonts/font-linux-biolinum"
cask "caskroom/fonts/font-linux-libertine"
cask "caskroom/fonts/font-stix"
cask "caskroom/fonts/font-symbola"
cask "caskroom/versions/java8"
